data = [
    {
      "bnkcode": "102100000021",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京通州支行新华分理处"
    },
    {
      "bnkcode": "102100000030",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京市分行营业部"
    },
    {
      "bnkcode": "102100000048",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东铁匠营支行"
    },
    {
      "bnkcode": "102100000056",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京崇文门外大街支行"
    },
    {
      "bnkcode": "102100000064",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京樱桃园支行"
    },
    {
      "bnkcode": "102100000072",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京王府井金街支行"
    },
    {
      "bnkcode": "102100000089",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南苑支行"
    },
    {
      "bnkcode": "102100000097",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南中轴路支行"
    },
    {
      "bnkcode": "102100000101",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东四南支行"
    },
    {
      "bnkcode": "102100000110",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京安定门支行"
    },
    {
      "bnkcode": "102100000128",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京左安门支行"
    },
    {
      "bnkcode": "102100000136",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京德外支行"
    },
    {
      "bnkcode": "102100000144",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京百万庄支行"
    },
    {
      "bnkcode": "102100000152",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京崇文支行永定门分理处"
    },
    {
      "bnkcode": "102100000169",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京燕山支行"
    },
    {
      "bnkcode": "102100000177",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京房山支行城关分理处"
    },
    {
      "bnkcode": "102100000185",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京菜市口支行"
    },
    {
      "bnkcode": "102100000193",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京广安门支行"
    },
    {
      "bnkcode": "102100000208",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京龙泉支行"
    },
    {
      "bnkcode": "102100000216",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京西河沿支行"
    },
    {
      "bnkcode": "102100000281",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京西四支行"
    },
    {
      "bnkcode": "102100000290",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新街口支行"
    },
    {
      "bnkcode": "102100000312",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京珠市口支行"
    },
    {
      "bnkcode": "102100000329",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京鼓楼支行"
    },
    {
      "bnkcode": "102100000337",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京长安支行"
    },
    {
      "bnkcode": "102100000345",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京朝阳支行"
    },
    {
      "bnkcode": "102100000353",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京望京支行"
    },
    {
      "bnkcode": "102100000361",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京礼士路支行"
    },
    {
      "bnkcode": "102100000370",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京广渠路支行"
    },
    {
      "bnkcode": "102100000388",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京八里庄支行"
    },
    {
      "bnkcode": "102100000415",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东四支行"
    },
    {
      "bnkcode": "102100000423",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京和平里支行"
    },
    {
      "bnkcode": "102100000431",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北新桥支行"
    },
    {
      "bnkcode": "102100000458",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京海淀西区支行营业室"
    },
    {
      "bnkcode": "102100000466",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京公主坟支行"
    },
    {
      "bnkcode": "102100000474",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京幸福街支行"
    },
    {
      "bnkcode": "102100000482",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京长辛店支行"
    },
    {
      "bnkcode": "102100000499",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京永定路支行"
    },
    {
      "bnkcode": "102100000562",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京英蓝中心支行"
    },
    {
      "bnkcode": "102100000587",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北辛安支行"
    },
    {
      "bnkcode": "102100000595",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京顺义支行"
    },
    {
      "bnkcode": "102100000600",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京首都机场支行"
    },
    {
      "bnkcode": "102100000618",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京清河镇支行"
    },
    {
      "bnkcode": "102100000626",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东升路支行"
    },
    {
      "bnkcode": "102100000634",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京惠新支行"
    },
    {
      "bnkcode": "102100000642",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京云岗支行"
    },
    {
      "bnkcode": "102100000659",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东高地支行"
    },
    {
      "bnkcode": "102100000683",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京管庄支行"
    },
    {
      "bnkcode": "102100000763",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京紫竹院支行"
    },
    {
      "bnkcode": "102100000802",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京琉璃厂支行"
    },
    {
      "bnkcode": "102100000819",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京体育馆路支行"
    },
    {
      "bnkcode": "102100000827",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京青塔支行"
    },
    {
      "bnkcode": "102100000886",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京百荣世贸路支行"
    },
    {
      "bnkcode": "102100001008",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北太平庄支行"
    },
    {
      "bnkcode": "102100001145",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大兴支行"
    },
    {
      "bnkcode": "102100001153",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京城关支行"
    },
    {
      "bnkcode": "102100001161",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南口支行"
    },
    {
      "bnkcode": "102100001170",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京沙河支行"
    },
    {
      "bnkcode": "102100001188",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司延庆县支行"
    },
    {
      "bnkcode": "102100001196",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京平谷支行"
    },
    {
      "bnkcode": "102100001215",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京怀柔支行"
    },
    {
      "bnkcode": "102100001223",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司密云支行"
    },
    {
      "bnkcode": "102100001274",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京燕莎支行"
    },
    {
      "bnkcode": "102100001282",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京永顺潞苑支行"
    },
    {
      "bnkcode": "102100001320",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京张家湾支行"
    },
    {
      "bnkcode": "102100001338",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京灵境支行"
    },
    {
      "bnkcode": "102100001346",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京八角支行"
    },
    {
      "bnkcode": "102100001354",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京八大处支行"
    },
    {
      "bnkcode": "102100001442",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京政达路支行"
    },
    {
      "bnkcode": "102100001910",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京香河园支行"
    },
    {
      "bnkcode": "102100002003",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京白云路支行"
    },
    {
      "bnkcode": "102100002020",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京金台路支行"
    },
    {
      "bnkcode": "102100002038",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京太平桥支行"
    },
    {
      "bnkcode": "102100002222",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京高井支行"
    },
    {
      "bnkcode": "102100002239",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京六铺炕支行"
    },
    {
      "bnkcode": "102100002247",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京石油大厦支行"
    },
    {
      "bnkcode": "102100002271",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京潘家园支行"
    },
    {
      "bnkcode": "102100002335",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京铁道支行"
    },
    {
      "bnkcode": "102100002484",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京天宁寺支行"
    },
    {
      "bnkcode": "102100002556",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京学院路支行"
    },
    {
      "bnkcode": "102100002564",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京马甸支行"
    },
    {
      "bnkcode": "102100002597",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京房山支行东风分理处"
    },
    {
      "bnkcode": "102100002644",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京房山支行良乡分理处"
    },
    {
      "bnkcode": "102100002652",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京市分行房山支行西潞园分理处"
    },
    {
      "bnkcode": "102100002669",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京房山支行二六六分理处"
    },
    {
      "bnkcode": "102100004113",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京市分行房山支行政通路分理处"
    },
    {
      "bnkcode": "102100004121",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中山街支行"
    },
    {
      "bnkcode": "102100004130",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京顺义支行牛栏山分理处"
    },
    {
      "bnkcode": "102100004148",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京会城门支行"
    },
    {
      "bnkcode": "102100004164",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京国贸大厦支行"
    },
    {
      "bnkcode": "102100004172",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京阜成路支行"
    },
    {
      "bnkcode": "102100004189",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北辰路支行"
    },
    {
      "bnkcode": "102100004197",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京建国路支行"
    },
    {
      "bnkcode": "102100004201",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京黄楼支行"
    },
    {
      "bnkcode": "102100004847",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大郊亭支行"
    },
    {
      "bnkcode": "102100004855",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京复外支行"
    },
    {
      "bnkcode": "102100004880",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大栅栏支行"
    },
    {
      "bnkcode": "102100004898",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京昌平支行"
    },
    {
      "bnkcode": "102100004919",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京陶然亭支行"
    },
    {
      "bnkcode": "102100004927",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京阜外大街支行"
    },
    {
      "bnkcode": "102100004935",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京四道口支行"
    },
    {
      "bnkcode": "102100004943",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京十里河支行"
    },
    {
      "bnkcode": "102100004951",
      "dreccode": "102100099996",
      "name": "中国工商银行总行营业部"
    },
    {
      "bnkcode": "102100004960",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京海淀支行营业部"
    },
    {
      "bnkcode": "102100004978",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京马家堡支行"
    },
    {
      "bnkcode": "102100004986",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京九棵树支行"
    },
    {
      "bnkcode": "102100005001",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司牡丹卡中心"
    },
    {
      "bnkcode": "102100005307",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京体育场支行"
    },
    {
      "bnkcode": "102100005331",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京运河迎宾支行"
    },
    {
      "bnkcode": "102100005340",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东长安街支行"
    },
    {
      "bnkcode": "102100005374",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京首都体育馆支行"
    },
    {
      "bnkcode": "102100005382",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京方庄支行"
    },
    {
      "bnkcode": "102100005905",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京经济技术开发区宏达北路支行"
    },
    {
      "bnkcode": "102100005921",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京平谷支行滨河工业区分理处"
    },
    {
      "bnkcode": "102100005930",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京正阳门支行　"
    },
    {
      "bnkcode": "102100006295",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京日坛路支行"
    },
    {
      "bnkcode": "102100006300",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京玉泉路支行"
    },
    {
      "bnkcode": "102100006471",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北京站支行"
    },
    {
      "bnkcode": "102100006480",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京安贞支行"
    },
    {
      "bnkcode": "102100006498",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京小汤山支行"
    },
    {
      "bnkcode": "102100006502",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京西直门支行"
    },
    {
      "bnkcode": "102100006609",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京西客站支行"
    },
    {
      "bnkcode": "102100006990",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京世纪金源支行"
    },
    {
      "bnkcode": "102100007777",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京市分行票据融资部"
    },
    {
      "bnkcode": "102100008018",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京白广路支行"
    },
    {
      "bnkcode": "102100008026",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京太平路支行"
    },
    {
      "bnkcode": "102100008034",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大都市支行"
    },
    {
      "bnkcode": "102100008042",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新世界支行"
    },
    {
      "bnkcode": "102100008059",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京四元桥支行"
    },
    {
      "bnkcode": "102100008067",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京商务中心区支行"
    },
    {
      "bnkcode": "102100008075",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京东城支行"
    },
    {
      "bnkcode": "102100008091",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京翠微路支行"
    },
    {
      "bnkcode": "102100008333",
      "dreccode": "102100099996",
      "name": "中国工商银行北京长安支行建国门内大街分理处"
    },
    {
      "bnkcode": "102100009019",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京天竺支行"
    },
    {
      "bnkcode": "102100009027",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京回龙观支行"
    },
    {
      "bnkcode": "102100009051",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新航站楼支行"
    },
    {
      "bnkcode": "102100009213",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京马连道茶城支行"
    },
    {
      "bnkcode": "102100009561",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中关村支行"
    },
    {
      "bnkcode": "102100009570",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中关村支行成府路分理处"
    },
    {
      "bnkcode": "102100009588",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京天通苑支行"
    },
    {
      "bnkcode": "102100009596",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京世纪村支行"
    },
    {
      "bnkcode": "102100009607",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京祥普支行"
    },
    {
      "bnkcode": "102100009623",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京九龙山支行"
    },
    {
      "bnkcode": "102100009631",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京世纪坛支行"
    },
    {
      "bnkcode": "102100009640",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新兴支行"
    },
    {
      "bnkcode": "102100009658",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南湖中园支行"
    },
    {
      "bnkcode": "102100009666",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京国展支行"
    },
    {
      "bnkcode": "102100009682",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南礼士路支行营业室"
    },
    {
      "bnkcode": "102100009703",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中关村支行建材城东路分理处"
    },
    {
      "bnkcode": "102100009746",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北苑家园支行"
    },
    {
      "bnkcode": "102100009754",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京光机电支行"
    },
    {
      "bnkcode": "102100009779",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京金地格林小镇支行"
    },
    {
      "bnkcode": "102100009787",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京公益桥支行"
    },
    {
      "bnkcode": "102100009795",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中航油支行"
    },
    {
      "bnkcode": "102100009800",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京隆庆街支行"
    },
    {
      "bnkcode": "102100009818",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京亚运村支行"
    },
    {
      "bnkcode": "102100009826",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京官园支行"
    },
    {
      "bnkcode": "102100009980",
      "dreccode": "102100099996",
      "name": "中国工商银行北京市分行清算中心"
    },
    {
      "bnkcode": "102100010022",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司票据营业部北京分部"
    },
    {
      "bnkcode": "102100011308",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司阿根廷人民币清算行"
    },
    {
      "bnkcode": "102100014355",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京经济技术开发区天宝园支行"
    },
    {
      "bnkcode": "102100014744",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京天秀支行"
    },
    {
      "bnkcode": "102100014816",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京花园东路支行"
    },
    {
      "bnkcode": "102100014857",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京京奥嘉园支行"
    },
    {
      "bnkcode": "102100014873",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京回龙观西区支行"
    },
    {
      "bnkcode": "102100015163",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大钟寺东路支行"
    },
    {
      "bnkcode": "102100015171",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新发地支行"
    },
    {
      "bnkcode": "102100015180",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京永丰支行"
    },
    {
      "bnkcode": "102100017005",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京荣华中路支行"
    },
    {
      "bnkcode": "102100018643",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京万寿路南口支行"
    },
    {
      "bnkcode": "102100018651",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京百旺新城支行"
    },
    {
      "bnkcode": "102100020044",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京范家胡同支行"
    },
    {
      "bnkcode": "102100020165",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京和平门内支行"
    },
    {
      "bnkcode": "102100020270",
      "dreccode": "102100099996",
      "name": "中国工商银行北京海运仓支行"
    },
    {
      "bnkcode": "102100020307",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京和平里北街支行"
    },
    {
      "bnkcode": "102100020323",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京福地广场支行"
    },
    {
      "bnkcode": "102100020331",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京北三环支行"
    },
    {
      "bnkcode": "102100020420",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京朗琴园支行"
    },
    {
      "bnkcode": "102100020438",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京青年湖支行"
    },
    {
      "bnkcode": "102100020454",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京星火西路支行"
    },
    {
      "bnkcode": "102100020462",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京新源里支行"
    },
    {
      "bnkcode": "102100020487",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京白家庄支行"
    },
    {
      "bnkcode": "102100020500",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中海凯旋支行"
    },
    {
      "bnkcode": "102100020518",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京搜宝商务中心支行"
    },
    {
      "bnkcode": "102100020534",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京和平街支行"
    },
    {
      "bnkcode": "102100020614",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南湖东园支行"
    },
    {
      "bnkcode": "102100020647",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京嘉美风尚支行"
    },
    {
      "bnkcode": "102100020655",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京大山子支行"
    },
    {
      "bnkcode": "102100020671",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京南十里居支行"
    },
    {
      "bnkcode": "102100020680",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京团结湖支行"
    },
    {
      "bnkcode": "102100020698",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京科学院支行"
    },
    {
      "bnkcode": "102100020778",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京西四环支行"
    },
    {
      "bnkcode": "102100020786",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京玉东支行"
    },
    {
      "bnkcode": "102100020794",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京知春路支行"
    },
    {
      "bnkcode": "102100020850",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京麦子店支行"
    },
    {
      "bnkcode": "102100020868",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京光华路支行"
    },
    {
      "bnkcode": "102100020913",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京万国城支行"
    },
    {
      "bnkcode": "102100020948",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京灯市口支行"
    },
    {
      "bnkcode": "102100020956",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京中环广场支行"
    },
    {
      "bnkcode": "102100020989",
      "dreccode": "102100099996",
      "name": "中国工商银行股份有限公司北京王府井支行"
    }
  ]

data2 = [{"name":"test"},{"password":"123456"}]
print(len(data2))
print(len(data))

# for i in range(0,len(data)):
#     print(i)